---
kind: method
id: M:Autodesk.Revit.DB.Electrical.CircuitNamingScheme.GetCombinedParameters
source: html/d54cc44d-d057-9f13-6d35-837bba8e0f32.htm
---
# Autodesk.Revit.DB.Electrical.CircuitNamingScheme.GetCombinedParameters Method

Gets the combined parameters.

## Syntax (C#)
```csharp
public IList<TableCellCombinedParameterData> GetCombinedParameters()
```

## Returns
Gets array of TableCellCombinedParameterData with the combined parameters data.